### Задача 1
Загрузите базу температур любым удобным способом. Выведите базу. Посчитайте число пустых записей в столбце State.

Ссылка на скачивание базы: https://drive.google.com/file/d/1bLiz_81Kb4pMryEalRe66jS38_F6vwMX/view?usp=sharing

In [ ]:
from google.colab import drive             # Подключаем Google диск
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

**Решение:**

In [ ]:
import pandas as pd                                                                    # Импортируем библиотеку pandas

my_t = pd.read_csv('/content/drive/My Drive/city_temperature.csv')                     # Читаем файл в формате csv и присваеваем переменной 

print ("\nЧисло пустых записей в столбце State:", my_t['State'].isna().sum(), "\n")    # Вывод количества пустых ячеек в столбце State

my_t                                                                                   # Вывод файла (базы). Без функции print для наглядности

/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (2) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

Число пустых записей в столбце State: 1450990

                Region  Country  ...  Year AvgTemperature
0               Africa  Algeria  ...  1995           64.2
1               Africa  Algeria  ...  1995           49.4
2               Africa  Algeria  ...  1995           48.8
3               Africa  Algeria  ...  1995           46.4
4               Africa  Algeria  ...  1995           47.9
...                ...      ...  ...   ...            ...
2906322  North America       US  ...  2013           82.4
2906323  North America       US  ...  2013           81.6
2906324  North America       US  ...  2013           84.2
2906325  North America       US  ...  2013           83.8
2906326  North America       US  ...  2013           83.6

[2906327 rows x 8 columns]

### Задача 2
Заполните пустые данные в базе словом "No". Запишите результат в ту же переменную. Выведите ее на экран.

**Решение:**

In [ ]:
my_t = my_t.fillna("No")                      # С помощью метода fillna заменяем пустые данные словом No и записываем результат в ту же переменную
print (my_t['State'].isna().sum())            # Проверка что не осталось пустых данных в столбце State
my_t                                          # Вывод на экран таблицы с новыми данными

0

                Region  Country  ...  Year AvgTemperature
0               Africa  Algeria  ...  1995           64.2
1               Africa  Algeria  ...  1995           49.4
2               Africa  Algeria  ...  1995           48.8
3               Africa  Algeria  ...  1995           46.4
4               Africa  Algeria  ...  1995           47.9
...                ...      ...  ...   ...            ...
2906322  North America       US  ...  2013           82.4
2906323  North America       US  ...  2013           81.6
2906324  North America       US  ...  2013           84.2
2906325  North America       US  ...  2013           83.8
2906326  North America       US  ...  2013           83.6

[2906327 rows x 8 columns]

### Задание 3

При помощи метода Pandas определите число уникальных записей в столбцах Country, City, Year.

**Решение:**

In [ ]:
print ("Способ 1\n")
print ("Число уникальных записей в столбце Country:",my_t.Country.nunique(dropna = True)) # Найдем число уникальных элементов в нужных столбцах с помощью метода nunique
print ("Число уникальных записей в столбце City:",my_t.City.nunique(dropna = True))
print ("Число уникальных записей в столбце Year:",my_t.Year.nunique(dropna = True))

print ("\nСпособ 2\n")
print ("Число уникальных записей в столбце Country:",len(my_t['Country'].unique()))   #Найдем число уникальных элементов в нужных столбцах с помощью метода unique и функции len
print ("Число уникальных записей в столбце City:",len(my_t['City'].unique()))
print ("Число уникальных записей в столбце Year:",len(my_t['Year'].unique()))

my_t[['Country', 'City']].describe(include=['O'])                        # Вывод с помощью метода describe для проверки

Способ 1

Число уникальных записей в столбце Country: 125
Число уникальных записей в столбце City: 321
Число уникальных записей в столбце Year: 28

Способ 2

Число уникальных записей в столбце Country: 125
Число уникальных записей в столбце City: 321
Число уникальных записей в столбце Year: 28

        Country         City
count   2906327      2906327
unique      125          321
top          US  Springfield
freq    1455337        18530

### Задача 4
При помощи библиотеки Pandas выведите строки, где в столбце Country встречается страна Russia.

При помощи метода Pandas отдельно выведите число элементов в этой выборке.

**Решение:**

In [ ]:
print ("Число элементов в строках которых встречается страна Russia:",my_t[my_t.Country == 'Russia'].size)                           # Определяем с помощью метода size и среза сколько элементов в выборке Russia                   
print ("Сколько всего не пустых записей в строках которых встречается страна Russia:",my_t[my_t.Country == 'Russia'].count().sum())  # В задание не входит. Посмотреть сколько из них заполненных
print ("")                                                                                                                           # Пустая строчка, чтобы отделить от таблицы
my_t[(my_t.Country == 'Russia')]                                                                                                     # Вывод строк где встречается страна Russia

Число элементов в строках которых встречается страна Russia: 99936
Сколько всего не пустых записей в строках которых встречается страна Russia: 99936

        Region Country State     City  Month  Day  Year  AvgTemperature
878256  Europe  Russia    No   Moscow      1    1  1995            32.3
878257  Europe  Russia    No   Moscow      1    2  1995            31.7
878258  Europe  Russia    No   Moscow      1    3  1995            26.8
878259  Europe  Russia    No   Moscow      1    4  1995            15.9
878260  Europe  Russia    No   Moscow      1    5  1995            23.8
...        ...     ...   ...      ...    ...  ...   ...             ...
890743  Europe  Russia    No  Yerevan     10   27  2003            53.3
890744  Europe  Russia    No  Yerevan     10   28  2003            51.9
890745  Europe  Russia    No  Yerevan     10   29  2003            54.3
890746  Europe  Russia    No  Yerevan     10   30  2003            44.3
890747  Europe  Russia    No  Yerevan     10   31  2003            40.1

[12492 rows x 8 columns]

### Задача 5
Создайте новый столбец температур, в котором будут записаны те же значения AvgTemperature, но в градусах Цельсия (исходная единица измерения - градусы Фаренгейта).

**Решение:**

In [ ]:
my_t['Celsius'] = round((my_t['AvgTemperature'] - 32) / 1.8, 1)            # Создаем еще один столбец для значений температуры в градусах Цельсия. 
                                                                           # Переводим по формуле Фарангейты в Цельсия. Округляем до одного знака после запятой и заносим в столбец Celsius
my_t                                                                       # Выводим обновленную таблицу

                Region  Country  ... AvgTemperature Celsius
0               Africa  Algeria  ...           64.2    17.9
1               Africa  Algeria  ...           49.4     9.7
2               Africa  Algeria  ...           48.8     9.3
3               Africa  Algeria  ...           46.4     8.0
4               Africa  Algeria  ...           47.9     8.8
...                ...      ...  ...            ...     ...
2906322  North America       US  ...           82.4    28.0
2906323  North America       US  ...           81.6    27.6
2906324  North America       US  ...           84.2    29.0
2906325  North America       US  ...           83.8    28.8
2906326  North America       US  ...           83.6    28.7

[2906327 rows x 9 columns]